import json

file_path = 'base.json'
new_data = {
    "Коника меловка 350 4+4": "c6085 мел350 4 + 4",
    "Коника меловка 300 4+4": "c6085 мел300 4 + 4",
    "Коника меловка 250 4+4": "c6085 мел250 4 + 4",
    "Коника меловка 200 4+4": "c6085 мел200 4 + 4",
    "Коника меловка 170 4+4": "c6085 мел170 4 + 4",
    "Коника меловка 150 4+4": "c6085 мел150 4 + 4",
    "Коника меловка 130 4+4": "c6085 мел130 4 + 4",
    "Коника меловка 115 4+4": "c6085 мел115 4 + 4",
    "Коника меловка 90 4+4": "c6085 мел90 4 + 4",
    "Коника меловка 350 4+0": "c6085 мел350 4 + 0",
    "Коника меловка 300 4+0": "c6085 мел300 4 + 0",
    "Коника меловка 250 4+0": "c6085 мел250 4 + 0",
    "Коника меловка 200 4+0": "c6085 мел200 4 + 0",
    "Коника меловка 170 4+0": "c6085 мел170 4 + 0",
    "Коника меловка 150 4+0": "c6085 мел150 4 + 0",
    "Коника меловка 130 4+0": "c6085 мел130 4 + 0",
    "Коника меловка 115 4+0": "c6085 мел115 4 + 0",
    "Коника меловка 90 4+0": "c6085 мел90 4 + 0",
    "Коника тинторетто 300": "c6085 tontoretto gesso 300",
    "Коника Icelite 2s toile moyene 300 г/ ": "c6085 icelite 2s toile moyene 300",
    "Коника Stardream gold 285 г/ ": "c6085 stardream gold 285",
    "Коника Sirio white white 350 г/ ": "c6085 sirio white white 350",
    "Коника Monnalisa 350 г/ ": "c6085 monnalisa 350",
    "Коника MUNKEN Polar 300 г/ ": "c6085 MUNKEN Polar 300",
    "Матовая ламинация 1+1": "ламин.мат 1 + 1",
    "Матовая ламинация 1+0": "ламин.мат 1 + 0",
    "Глянцевая ламинация 1+1": "ламин.глянец 1 + 1",
    "Глянцевая ламинация 1+0": "ламин.глянец 1 + 0",
    "Ламинация софтач 1+1": "ламин.soft-touch 1 + 1",
    "Ламинация софтач 1+0": "ламин.soft-touch 1 + 0",
    "Ручная порезка (резак)": "ПОРЕЗКА",
    "Скругление углов (ручное)": "РУЧНОЕ СКРУГЛЕНИЕ УГЛОВ",
    "IECHO магнит": "IECHO магнит",
    "IECHO поштучно (сквозная)": "IECHO насквозь ",
    "MGI лак": "MGI лак",
    "MGI gold": "MGI gold",
    "MGI silver": "MGI silver",
    "MGI gold.лак": "MGI gold.лак",
    "MGI silver.лак": "MGI silver.лак",
    "Листовой плоттер до подложки": "F-mark до подложки",
    "Самоклейка бумага 1+0": "c6085 Самкл.бум 1+0",
    "Самоклейка бумажная 4+0": "c6085 Самокл.бум 4+0",
    "Пленка белая 1+0": "c6085 Оракал Б 1+0",
    "Пленка белая 4+0": "c6085 Оракал Б 4+0",
    "Пленка прозрачная 1+0": "c6085 Прозрачный 1+0",
    "Пленка прозрачная 4+0": "c6085 Прозрачный 4+0",
    "IECHO стикерпак до подложки и насквозь" : "iECHO листовая до подложки + насквозь",
}


def start_app(f_path):
    try:
        with open(f_path, 'r') as file:
            data = json.load(file)
    except FileNotFoundError:
        data = {}
    return data


def save_new_data(data, n_data):
    data.update(n_data)
    with open(file_path, 'w') as file:
        json.dump(data, file, indent=4)


info_data = start_app(file_path)
save_new_data(info_data, new_data)
